# FabricNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheet..::..FabricNumber Property
FabricSheet Class See Also
---
Specifies the numerical parameter assigned to the fabric sheet and any sheet of the same type, dimension, material, shape, and partition.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string FabricNumber { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FabricNumber As String
	Get
```

Visual C++
---
```text
public:
property String^ FabricNumber {
	String^ get ();
}
```

# Remarks
Value of this property corresponds to the **Fabric Number** parameter of Rebar as available in both the UI and API. Refer to the [!:NumberingSchema] class for details related to numbering Rebar and Fabrics.
# See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace